In [1]:
import numpy as np
import pandas as pd

In [2]:
s = pd.Series([1, 2, np.nan])

In [5]:
s[0]
s.sum()

3.0

In [6]:
df = pd.DataFrame({'A': [1, 2], 'B': [3, 4]})
df

   A  B
0  1  3
1  2  4

In [7]:
df.dtypes

A    int64
B    int64
dtype: object

In [8]:
df = pd.DataFrame(np.random.randn(6, 4))
df

          0         1         2         3
0  0.252070  1.008904  0.370759 -0.505896
1 -0.389568 -0.184550 -0.255648 -0.454720
2 -0.014164  0.597492 -0.117775  0.054145
3  0.106298  0.403183 -0.688880  1.603715
4 -0.472988  0.710045 -0.175718 -1.075996
5  0.867440  1.596179 -0.061513 -0.338257

In [16]:
df = pd.DataFrame(np.random.randn(6, 4), index=pd.date_range('20170101', periods=6))
df

                   0         1         2         3
2017-01-01 -0.385478  1.007187  0.613939  0.593957
2017-01-02  0.917846 -0.619568 -0.244904 -0.224514
2017-01-03 -0.062307  1.892378  0.666331 -0.101513
2017-01-04  0.956826  0.416880  1.393448  0.919468
2017-01-05  0.524945  0.932657  0.889791 -0.293310
2017-01-06  0.471324  0.050078 -0.815260 -0.921172

In [15]:
df = pd.DataFrame(np.random.randn(6, 4), index=pd.date_range('20170101', periods=6), columns=['A', 'B', 'C', 'D'])
df

                   A         B         C         D
2017-01-01 -0.934376 -1.561566 -0.087049 -0.628385
2017-01-02  0.268845  1.215075  1.869635 -1.591586
2017-01-03  0.966076 -0.081330 -0.432708 -0.669004
2017-01-04 -2.068542  1.147725 -1.630496  0.808484
2017-01-05  0.900254  0.462131  0.589592  0.917068
2017-01-06 -1.259823  0.654844  0.009260 -0.255830

In [17]:
df.head(1)

                   0         1         2         3
2017-01-01 -0.385478  1.007187  0.613939  0.593957

In [18]:
df.tail(3)

                   0         1         2         3
2017-01-04  0.956826  0.416880  1.393448  0.919468
2017-01-05  0.524945  0.932657  0.889791 -0.293310
2017-01-06  0.471324  0.050078 -0.815260 -0.921172

In [19]:
df.index

DatetimeIndex(['2017-01-01', '2017-01-02', '2017-01-03', '2017-01-04',
               '2017-01-05', '2017-01-06'],
              dtype='datetime64[ns]', freq='D')

In [20]:
df.columns

RangeIndex(start=0, stop=4, step=1)

In [21]:
df.values

array([[-0.38547767,  1.00718732,  0.61393877,  0.59395725],
       [ 0.91784584, -0.61956817, -0.2449043 , -0.22451398],
       [-0.06230668,  1.8923784 ,  0.6663311 , -0.10151297],
       [ 0.95682564,  0.41688036,  1.39344809,  0.91946789],
       [ 0.52494519,  0.93265747,  0.88979124, -0.29330972],
       [ 0.47132412,  0.05007789, -0.81526021, -0.92117213]])

In [22]:
df.describe()

              0         1         2         3
count  6.000000  6.000000  6.000000  6.000000
mean   0.403859  0.613269  0.417224 -0.004514
std    0.534702  0.868210  0.804303  0.662327
min   -0.385478 -0.619568 -0.815260 -0.921172
25%    0.071101  0.141779 -0.030194 -0.276111
50%    0.498135  0.674769  0.640135 -0.163013
75%    0.819621  0.988555  0.833926  0.420090
max    0.956826  1.892378  1.393448  0.919468

In [23]:
df.T

   2017-01-01  2017-01-02  2017-01-03  2017-01-04  2017-01-05  2017-01-06
0   -0.385478    0.917846   -0.062307    0.956826    0.524945    0.471324
1    1.007187   -0.619568    1.892378    0.416880    0.932657    0.050078
2    0.613939   -0.244904    0.666331    1.393448    0.889791   -0.815260
3    0.593957   -0.224514   -0.101513    0.919468   -0.293310   -0.921172

In [25]:
df.sort_values(by=0)

                   0         1         2         3
2017-01-01 -0.385478  1.007187  0.613939  0.593957
2017-01-03 -0.062307  1.892378  0.666331 -0.101513
2017-01-06  0.471324  0.050078 -0.815260 -0.921172
2017-01-05  0.524945  0.932657  0.889791 -0.293310
2017-01-02  0.917846 -0.619568 -0.244904 -0.224514
2017-01-04  0.956826  0.416880  1.393448  0.919468

In [26]:
df[0:3]

                   0         1         2         3
2017-01-01 -0.385478  1.007187  0.613939  0.593957
2017-01-02  0.917846 -0.619568 -0.244904 -0.224514
2017-01-03 -0.062307  1.892378  0.666331 -0.101513

In [27]:
df['20170102':'20170104']

                   0         1         2         3
2017-01-02  0.917846 -0.619568 -0.244904 -0.224514
2017-01-03 -0.062307  1.892378  0.666331 -0.101513
2017-01-04  0.956826  0.416880  1.393448  0.919468

In [28]:
df.loc['20170101']

0   -0.385478
1    1.007187
2    0.613939
3    0.593957
Name: 2017-01-01 00:00:00, dtype: float64

In [29]:
df.loc['20170102', [1, 2]]

1   -0.619568
2   -0.244904
Name: 2017-01-02 00:00:00, dtype: float64

In [31]:
df.iloc[0, 0]

-0.3854776728783673

In [32]:
df.iloc[0:2, 0:2]

                   0         1
2017-01-01 -0.385478  1.007187
2017-01-02  0.917846 -0.619568

In [36]:
df[df > 0]

                   0         1         2         3
2017-01-01       NaN  1.007187  0.613939  0.593957
2017-01-02  0.917846       NaN       NaN       NaN
2017-01-03       NaN  1.892378  0.666331       NaN
2017-01-04  0.956826  0.416880  1.393448  0.919468
2017-01-05  0.524945  0.932657  0.889791       NaN
2017-01-06  0.471324  0.050078       NaN       NaN

In [37]:
df

                   0         1         2         3
2017-01-01 -0.385478  1.007187  0.613939  0.593957
2017-01-02  0.917846 -0.619568 -0.244904 -0.224514
2017-01-03 -0.062307  1.892378  0.666331 -0.101513
2017-01-04  0.956826  0.416880  1.393448  0.919468
2017-01-05  0.524945  0.932657  0.889791 -0.293310
2017-01-06  0.471324  0.050078 -0.815260 -0.921172

In [43]:
df2 = df.copy()
df2[4] = ['one', 'two', 'three', 'four', 'five', 'six']

In [44]:
df2

                   0         1         2         3      4
2017-01-01 -0.385478  1.007187  0.613939  0.593957    one
2017-01-02  0.917846 -0.619568 -0.244904 -0.224514    two
2017-01-03 -0.062307  1.892378  0.666331 -0.101513  three
2017-01-04  0.956826  0.416880  1.393448  0.919468   four
2017-01-05  0.524945  0.932657  0.889791 -0.293310   five
2017-01-06  0.471324  0.050078 -0.815260 -0.921172    six

In [45]:
df2.shift(1)

                   0         1         2         3      4
2017-01-01       NaN       NaN       NaN       NaN    NaN
2017-01-02 -0.385478  1.007187  0.613939  0.593957    one
2017-01-03  0.917846 -0.619568 -0.244904 -0.224514    two
2017-01-04 -0.062307  1.892378  0.666331 -0.101513  three
2017-01-05  0.956826  0.416880  1.393448  0.919468   four
2017-01-06  0.524945  0.932657  0.889791 -0.293310   five

In [46]:
df = pd.DataFrame(np.random.randn(2, 2))

In [47]:
df

          0         1
0  0.650018  0.231956
1 -1.725496  0.941834

In [48]:
pd.concat([df, df])

          0         1
0  0.650018  0.231956
1 -1.725496  0.941834
0  0.650018  0.231956
1 -1.725496  0.941834

In [49]:
df = pd.DataFrame(np.random.rand(8, 4), columns=['A', 'B', 'C', 'D'])

In [50]:
s = df.iloc[0]
s

A    0.496136
B    0.532002
C    0.883732
D    0.119842
Name: 0, dtype: float64

In [51]:
df.append(s)

          A         B         C         D
0  0.496136  0.532002  0.883732  0.119842
1  0.610229  0.127293  0.877212  0.354286
2  0.476330  0.274658  0.535455  0.333079
3  0.646003  0.029256  0.610402  0.897085
4  0.373920  0.731706  0.697645  0.366383
5  0.157987  0.013900  0.530698  0.667510
6  0.666153  0.080699  0.180746  0.492635
7  0.447344  0.726778  0.762264  0.045347
0  0.496136  0.532002  0.883732  0.119842

In [52]:
df.append(s, ignore_index=True)

          A         B         C         D
0  0.496136  0.532002  0.883732  0.119842
1  0.610229  0.127293  0.877212  0.354286
2  0.476330  0.274658  0.535455  0.333079
3  0.646003  0.029256  0.610402  0.897085
4  0.373920  0.731706  0.697645  0.366383
5  0.157987  0.013900  0.530698  0.667510
6  0.666153  0.080699  0.180746  0.492635
7  0.447344  0.726778  0.762264  0.045347
8  0.496136  0.532002  0.883732  0.119842

In [53]:
df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar'], 'B': np.random.randn(4)})
df

     A         B
0  foo  0.986566
1  bar  1.048185
2  foo  0.262395
3  bar  0.203289

In [54]:
df.groupby('A').sum()

            B
A
bar  1.251474
foo  1.248961

In [2]:
# w
import pandas_datareader
s = pandas_datareader.data.DataReader('AAPL', 'yahoo', '2014-01-01')

ModuleNotFoundError: No module named 'pandas_datareader'